twitter/app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all

	@tweet = Tweet.new(params[:tweet])
    respond_to do |format|
      if @tweet.save
---
SELECT "tweets".* FROM "tweets"
INSERT INTO "tweets" ("created_at", "message", "status", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 09 Aug 2012 07:49:14 UTC +00:00], ["message", nil], ["status", nil], ["updated_at", Thu, 09 Aug 2012 07:49:14 UTC +00:00], ["user", nil]]

  def update
    @tweet = Tweet.find(params[:id])

    respond_to do |format|
      if @tweet.update_attributes(params[:tweet])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "tweets" SET "message" = 'sin status', "updated_at" = '2012-08-09 09:04:35.336268' WHERE "tweets"."id" = 14